The number of slots in the panel schedule; setting this value must go through the appropriate update function
  Namespace:   Autodesk.Revit.DB.Electrical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public int NumberOfSlots { get; }
  Visual Basic
Public ReadOnly Property NumberOfSlots As Integer
	Get
  Visual C++
public:
property int NumberOfSlots {
	int get ();
}
 See Also
  PanelScheduleData Class
  Autodesk.Revit.DB.Electrical Namespace